; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-5-9)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	)
(:init
	(at plane1 city3)
	(= (capacity plane1) 6783)
	(= (fuel plane1) 587)
	(= (slow-burn plane1) 3)
	(= (fast-burn plane1) 11)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 10)
	(at plane2 city0)
	(= (capacity plane2) 8394)
	(= (fuel plane2) 1666)
	(= (slow-burn plane2) 3)
	(= (fast-burn plane2) 11)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 8)
	(at plane3 city0)
	(= (capacity plane3) 8940)
	(= (fuel plane3) 2214)
	(= (slow-burn plane3) 3)
	(= (fast-burn plane3) 11)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 2)
	(at plane4 city7)
	(= (capacity plane4) 10949)
	(= (fuel plane4) 3181)
	(= (slow-burn plane4) 4)
	(= (fast-burn plane4) 14)
	(= (onboard plane4) 0)
	(= (zoom-limit plane4) 4)
	(at plane5 city6)
	(= (capacity plane5) 3053)
	(= (fuel plane5) 633)
	(= (slow-burn plane5) 1)
	(= (fast-burn plane5) 2)
	(= (onboard plane5) 0)
	(= (zoom-limit plane5) 6)
	(at person1 city4)
	(at person2 city3)
	(at person3 city7)
	(at person4 city4)
	(at person5 city4)
	(at person6 city7)
	(at person7 city0)
	(at person8 city8)
	(at person9 city4)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 963)
	(= (distance city0 city2) 763)
	(= (distance city0 city3) 654)
	(= (distance city0 city4) 751)
	(= (distance city0 city5) 876)
	(= (distance city0 city6) 702)
	(= (distance city0 city7) 724)
	(= (distance city0 city8) 610)
	(= (distance city0 city9) 916)
	(= (distance city1 city0) 963)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 702)
	(= (distance city1 city3) 537)
	(= (distance city1 city4) 624)
	(= (distance city1 city5) 690)
	(= (distance city1 city6) 517)
	(= (distance city1 city7) 684)
	(= (distance city1 city8) 758)
	(= (distance city1 city9) 978)
	(= (distance city2 city0) 763)
	(= (distance city2 city1) 702)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 680)
	(= (distance city2 city4) 789)
	(= (distance city2 city5) 866)
	(= (distance city2 city6) 620)
	(= (distance city2 city7) 895)
	(= (distance city2 city8) 586)
	(= (distance city2 city9) 508)
	(= (distance city3 city0) 654)
	(= (distance city3 city1) 537)
	(= (distance city3 city2) 680)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 729)
	(= (distance city3 city5) 852)
	(= (distance city3 city6) 864)
	(= (distance city3 city7) 535)
	(= (distance city3 city8) 718)
	(= (distance city3 city9) 930)
	(= (distance city4 city0) 751)
	(= (distance city4 city1) 624)
	(= (distance city4 city2) 789)
	(= (distance city4 city3) 729)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 590)
	(= (distance city4 city6) 681)
	(= (distance city4 city7) 693)
	(= (distance city4 city8) 745)
	(= (distance city4 city9) 932)
	(= (distance city5 city0) 876)
	(= (distance city5 city1) 690)
	(= (distance city5 city2) 866)
	(= (distance city5 city3) 852)
	(= (distance city5 city4) 590)
	(= (distance city5 city5) 0)
	(= (distance city5 city6) 570)
	(= (distance city5 city7) 948)
	(= (distance city5 city8) 657)
	(= (distance city5 city9) 680)
	(= (distance city6 city0) 702)
	(= (distance city6 city1) 517)
	(= (distance city6 city2) 620)
	(= (distance city6 city3) 864)
	(= (distance city6 city4) 681)
	(= (distance city6 city5) 570)
	(= (distance city6 city6) 0)
	(= (distance city6 city7) 864)
	(= (distance city6 city8) 859)
	(= (distance city6 city9) 718)
	(= (distance city7 city0) 724)
	(= (distance city7 city1) 684)
	(= (distance city7 city2) 895)
	(= (distance city7 city3) 535)
	(= (distance city7 city4) 693)
	(= (distance city7 city5) 948)
	(= (distance city7 city6) 864)
	(= (distance city7 city7) 0)
	(= (distance city7 city8) 988)
	(= (distance city7 city9) 549)
	(= (distance city8 city0) 610)
	(= (distance city8 city1) 758)
	(= (distance city8 city2) 586)
	(= (distance city8 city3) 718)
	(= (distance city8 city4) 745)
	(= (distance city8 city5) 657)
	(= (distance city8 city6) 859)
	(= (distance city8 city7) 988)
	(= (distance city8 city8) 0)
	(= (distance city8 city9) 735)
	(= (distance city9 city0) 916)
	(= (distance city9 city1) 978)
	(= (distance city9 city2) 508)
	(= (distance city9 city3) 930)
	(= (distance city9 city4) 932)
	(= (distance city9 city5) 680)
	(= (distance city9 city6) 718)
	(= (distance city9 city7) 549)
	(= (distance city9 city8) 735)
	(= (distance city9 city9) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at person1 city3)
	(at person2 city1)
	(at person3 city3)
	(at person4 city1)
	(at person5 city9)
	(at person6 city7)
	(at person7 city1)
	(at person8 city1)
	(at person9 city1)
	))

(:metric minimize (+ (* 1 (total-time))  (* 4 (total-fuel-used))))
)

; plan
1. (refuel plane3 city0)
   changed: (fuel plane3) from 2214 to 8940
   goals met: 1 of 9
2. (board person3 plane4 city7)
   deleted: (at person3 city7)
   added: (in person3 plane4)
   changed: (onboard plane4) from 0 to 1
   goals met: 1 of 9
3. (fly plane4 city7 city3)
   deleted: (at plane4 city7)
   added: (at plane4 city3)
   changed: (total-fuel-used) from 0 to 2140, (fuel plane4) from 3181 to 1041
   goals met: 1 of 9
4. (fly plane3 city0 city3)
   deleted: (at plane3 city0)
   added: (at plane3 city3)
   changed: (total-fuel-used) from 2140 to 4102, (fuel plane3) from 8940 to 6978
   goals met: 1 of 9
5. (debark person3 plane4 city3)
   deleted: (in person3 plane4)
   added: (at person3 city3)
   changed: (onboard plane4) from 1 to 0
   goals met: 2 of 9
6. (board person2 plane3 city3)
   deleted: (at person2 city3)
   added: (in person2 plane3)
   changed: (onboard plane3) from 0 to 1
   goals met: 2 of 9
7. (fly plane3 city3 city4)
   deleted: (at plane3 city3)
   added: (at plane3 city4)
   changed: (total-fuel-used) from 4102 to 6289, (fuel plane3) from 6978 to 4791
   goals met: 2 of 9
8. (board person1 plane3 city4)
   deleted: (at person1 city4)
   added: (in person1 plane3)
   changed: (onboard plane3) from 1 to 2
   goals met: 2 of 9
9. (board person4 plane3 city4)
   deleted: (at person4 city4)
   added: (in person4 plane3)
   changed: (onboard plane3) from 2 to 3
   goals met: 2 of 9
10. (board person5 plane3 city4)
   deleted: (at person5 city4)
   added: (in person5 plane3)
   changed: (onboard plane3) from 3 to 4
   goals met: 2 of 9
11. (board person7 plane2 city0)
   deleted: (at person7 city0)
   added: (in person7 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 2 of 9
12. (board person9 plane3 city4)
   deleted: (at person9 city4)
   added: (in person9 plane3)
   changed: (onboard plane3) from 4 to 5
   goals met: 2 of 9
13. (refuel plane2 city0)
   changed: (fuel plane2) from 1666 to 8394
   goals met: 2 of 9
14. (fly plane2 city0 city1)
   deleted: (at plane2 city0)
   added: (at plane2 city1)
   changed: (total-fuel-used) from 6289 to 9178, (fuel plane2) from 8394 to 5505
   goals met: 2 of 9
15. (debark person7 plane2 city1)
   deleted: (in person7 plane2)
   added: (at person7 city1)
   changed: (onboard plane2) from 1 to 0
   goals met: 3 of 9
16. (fly plane3 city4 city8)
   deleted: (at plane3 city4)
   added: (at plane3 city8)
   changed: (total-fuel-used) from 9178 to 11413, (fuel plane3) from 4791 to 2556
   goals met: 3 of 9
17. (board person8 plane3 city8)
   deleted: (at person8 city8)
   added: (in person8 plane3)
   changed: (onboard plane3) from 5 to 6
   goals met: 3 of 9
18. (fly plane3 city8 city1)
   deleted: (at plane3 city8)
   added: (at plane3 city1)
   changed: (total-fuel-used) from 11413 to 13687, (fuel plane3) from 2556 to 282
   goals met: 3 of 9
19. (refuel plane3 city1)
   changed: (fuel plane3) from 282 to 8940
   goals met: 3 of 9
20. (debark person2 plane3 city1)
   deleted: (in person2 plane3)
   added: (at person2 city1)
   changed: (onboard plane3) from 6 to 5
   goals met: 4 of 9
21. (debark person4 plane3 city1)
   deleted: (in person4 plane3)
   added: (at person4 city1)
   changed: (onboard plane3) from 5 to 4
   goals met: 5 of 9
22. (debark person8 plane3 city1)
   deleted: (in person8 plane3)
   added: (at person8 city1)
   changed: (onboard plane3) from 4 to 3
   goals met: 6 of 9
23. (debark person9 plane3 city1)
   deleted: (in person9 plane3)
   added: (at person9 city1)
   changed: (onboard plane3) from 3 to 2
   goals met: 7 of 9
24. (fly plane3 city1 city3)
   deleted: (at plane3 city1)
   added: (at plane3 city3)
   changed: (total-fuel-used) from 13687 to 15298, (fuel plane3) from 8940 to 7329
   goals met: 7 of 9
25. (debark person1 plane3 city3)
   deleted: (in person1 plane3)
   added: (at person1 city3)
   changed: (onboard plane3) from 2 to 1
   goals met: 8 of 9
26. (fly plane3 city3 city9)
   deleted: (at plane3 city3)
   added: (at plane3 city9)
   changed: (total-fuel-used) from 15298 to 18088, (fuel plane3) from 7329 to 4539
   goals met: 8 of 9
27. (debark person5 plane3 city9)
   deleted: (in person5 plane3)
   added: (at person5 city9)
   changed: (onboard plane3) from 1 to 0
   goals met: 9 of 9
